In [1]:
import numpy as np
import pandas as pd

In [2]:
data={
    "A":[1,2,np.nan,4,5],
    "B":[1,2,3,4,5],
    "C":[1,2,3,np.nan,np.nan],
    "D":[1,np.nan,np.nan,np.nan,5]
}
df=pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [10]:
df.isna() #tell in df where the NaN(null value) exists

       A      B      C      D
0  False  False  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [11]:
df.isna().sum() #tells total no. of null values in each column

A    1
B    0
C    2
D    3
dtype: int64

In [27]:
#Removing the missing data

In [4]:
df.dropna() #removes all the rows having NaN

     A  B    C    D
0  1.0  1  1.0  1.0

In [7]:
df.dropna(thresh=3) #checks if atleast there are non NaN values equal to thresh

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [12]:
#Filling the missing data

In [18]:
df.fillna(34)

      A  B     C     D
0   1.0  1   1.0   1.0
1   2.0  2   2.0  34.0
2  34.0  3   3.0  34.0
3   4.0  4  34.0  34.0
4   5.0  5  34.0   5.0

In [19]:
values={'A':10,'B':20,'C':30,'D':40}
df.fillna(value=values)

      A  B     C     D
0   1.0  1   1.0   1.0
1   2.0  2   2.0  40.0
2  10.0  3   3.0  40.0
3   4.0  4  30.0  40.0
4   5.0  5  30.0   5.0

In [28]:
df.fillna(df.mean(),inplace=True)

In [29]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0